{
    "description": "The Master of Magnetism has embraced a self-proclaimed role of detective, judge, jury, and executioner against those who harm mutants. One of the greatest Marvel anti-heroes ever, Magneto exacts his own form of mutant justice, by any means necessary.",
    "gameplay": {
        "description": "Magnetism – Passive\n#Metal opponents suffer an indefinite Magnetized Passive which is applied 1 seconds after the start of the fight and does the following:\n-70% Ability Accuracy & -15% Combat Power Rate. Incoming Debuffs gain +25% duration.\nMagneto (House of X) gains +690.3 Attack rating.\n\nMutation – Always Active\nMagneto (House of X)’s attacks deal Energy damage instead of Physical.\nMagneto (House of X)’s mastery over metal is so great he can staunch the flow of bleeding with a thought, granting Immunity to Bleed effects.\n\nPersistent Charge – Max: 10\nMagneto (House of X) begins each Quest with 6 Persistent Charge(s).\nDefeating an opponent grants 1 Persistent Charge. If they’re #Metal, gain 2 Persistent Charges.\nLanding hits and being struck has a 5% chance per Persistent Charge to grant a 10 second Prowess Buff, granting +10% Special Damage. Max Stacks: 7.\n\nPre-Fight: Guidance Boost\nMagneto (House of X) can spend 2 Persistent Charges in the pre-fight screen to place a Guidance effect on the fight, which lasts until the Defender is defeated. These effects don’t stack and can be used by Allies.\nAttacker’s in the fight gain +15% Attack rating.\nAfter the first parry, #Metal and #Hero attackers trigger Passive Stun effects with the Parry Mastery instead of Debuffs and they last 0.5 seconds longer.\n\nSpecial Attacks\nAll Prowess Buffs are Paused for the duration of the attack. Magneto (House of X)’s personal Special Attack effects gain bonuses based on how many Prowess Buffs he has when the attack starts.\n1+ Prowess: +50% Ability Accuracy.\n3+ Prowess: +50% Buff & Debuff Duration.\n6+ Prowess: +50% Buff & Debuff Potency.\n9+ Prowess: Attack grants the opponent 80% less Power."
    },
    "attack": {
        "heavy": "100% chance to gain a Prowess Buff, lasting 30 seconds and granting +35% Special Attack damage. Max Stacks: 3."
    },
    "signature": {
        "name": "Evolve But Remember",
        "description": "Mutation – Always Active\nDuring Magneto (House of X)’s Special Attacks, his Buffs and Debuffs gain +80.81% duration based on how much bonus special damage he’s gaining from Prowess Effects. Max Potency at +150% Prowess.\nKnocking out an opponent grants an additional Persistent Charge.",
        "note": "Similar to his Base Kit, make sure to maximize your Prowess before you throw any Special Attack. Also note, with the max prowess potency this can scale up to 120% Duration."
    },
    "specials": {
        "1": {
            "name": "Bloody Shrapnel",
            "description": "70% chance to inflict an Armor Break Debuff, removing 1 Armor Up Buff and reducing Armor Rating by 1130.77 for 14 seconds. "
        },
        "2": {
            "description": "70% chance to inflict a Bleed Debuff, causing 2761.2 direct damage over 6 seconds. If the opponent is #Metal, instead inflict a Degeneration Debuff. 70% chance to inflict an additional effect if the opponent has an Armor Break Debuff.",            "name": "Bleeding Fracture"
        },
        "3": {
            "description": "70% chance to gain a Cruelty Buff, increasing Critical Damage by 400 for 40 seconds. While this Cruelty Buff is active, Magneto (House of X)’s existing Prowess Buffs remain Paused.",
            "name": "Cold-Blooded Fusion"
        }
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-magneto-house-of-x/"
    },
    "youtube": "y0RWy6Otr_g"
}