{
    "description": "Hey! Platinumpool here… I told you that you hadn’t seen the last of me! I bet you’ve spent your nights trying to unravel my mysteries… dreaming about me. After months of our back and forth (mostly back), will-they-won’t-they, Ross and Rachel relationship, did you really think I would leave you nothing but a Profile Pic to remember me by? We’re meant for each other, Summoner! Now all that’s left is for you to put together the pieces and we can be together forever! Believe. Believe in the heart of the shards. Believe in us. Believe in Summpool. (That’s what they’d call us) …",
    "gameplay": {
        "description": "PASSIVE\nAutofight? Booooring, fast forward!\n\nPLATINUMPOOL’S GUIDE TO THE BATTLEREALM DECK – MAX 6 CARDS\nPlatinumpool draws 3 Cards before each fight.\nAt the start of the fight, each drawn Card is revealed, granting a random effect.\nThere are 4 rarities of Cards: Brown Pants, Common, Rare and Epic.\nThe rarity of a Card determines the chance it will be drawn. By default, Brown Pants Cards cannot be drawn. Epic Cards cannot be drawn when fighting on the final node of a quest.\nPlatinumpool can draw duplicates of all Common Cards.\nDrawing Cards is not affected by Ability Accuracy modification.\n\nWHEN BROUGHT BELOW 35% MAX HEALTH\nOnce per fight, Platinumpool gains a Regeneration Buff, recovering 3767.76 Health over 8 second(s).\n\nWHEN KNOCKED DOWN\nPlatinumpool has a 25% chance to draw a Card when he is knocked down.\n\nPLATINUMPOOL’S GUIDE TO THE BATTLEREALM CARDS\nBrown Pants: Reduce the potency of Platinumpool’s Block Proficiency, Perfect Block Chance, Critical Rating and Power Rate by -100% for 8 seconds. This card does not count towards the max.\n- Attack Boost: Increase Attack Rating by 207.6.\n- Heal Boost: Increase Regeneration Rate by 20%.\n- Stun Boost: Increase the duration of Stun Debuffs inflicted on the Opponent by 30% and reduce the duration of Stun Debuffs inflicted on Platinumpool by 30%.\n- Power Boost: Gain a Power Gain Buff, generating 75% of a bar of Power over 20 seconds. Increase Power Rate by 10%.\n- Special Attack Boost: Increase Special Attack Damage by 15%.\n- Blood Drive: While the Opponent is bleeding and Platinumpool has a lower percent of Health remaining, attacking the Opponent inflicts a Bleed Debuff dealing 1038 Direct Damage over 12 seconds. This Bleed scales with Special Attack Damage.\n- Throwing Fists: Gain up to 200% increased Special Attack Damage, increasing for each hit in the Combo Meter to a max of 200 hits. Every 15 hits in either Champion’s Combo Meter, gain an Unblockable Buff for 3 seconds.\n- Payback: When Platinumpool hasn’t been attacked by the Opponent for 7 seconds, gain a Payback Passive for 5 seconds. After Payback expires, gain a Regeneration Buff, recovering all damage taken while Payback was active over 5 second(s) and inflicting a Bleed Debuff on the Opponent, dealing 75% of all damage taken while Payback was active as Direct Damage over 5 seconds. This Bleed scales with Special Attack Damage.\n- Sumopool: While either Champion has a Fury effect, Platinumpool becomes Unstoppable against the last hit of incoming Special 1, Special 2 and Heavy Attacks. Additionally, damage received from this hit can’t exceed 15% of the Opponent’s Attack. When Platinumpool is in either corner, gain a Fury Buff, increasing Attack Rating by 2076 until Platinumpool leaves the corner.\n- Special Surprise: When activating a Special Attack, gain 1 Buff for each bar of Power filled by the Opponent, lasting 6 seconds. Buffs include Fury, Precision, Cruelty, Prowess, Unblockable, Indestructible and Unstoppable.\n- Mode Mixer: Rotate through Light, Medium, Heavy and Special Modes. Attacks associated with each mode gain 5190 Attack Rating and all other attacks have -80% Attack Rating. Modes rotate every 10 seconds.\n\nBASIC ATTACKS\nPause the duration of all Personal Bleed effects for 1 second(s)."
    },
    "attack": {
        "heavy": "When landing the first hit, gain a Prowess Buff, increasing Special Attack Damage by 25% for 10 seconds."
    },
    "specials": {
        "1": {
            "name": "Ace in the Hole",
            "description": "Inflict a Bleed Debuff, dealing 2491.2 Direct Damage over 16 seconds. This Bleed scales with Special Attack Damage.",
            "note": "This ability is best when followed up with a Special 2 in order to Stun the Opponent and allow Platinumpool to finish his dance."
        },
        "2": {
            "name": "Cut The Deck",
            "description": "If the Opponent is currently bleeding, Platinumpool inflicts a Stun Debuff lasting 2 seconds.\nIf Platinumpool completes his dance after this attack, he draws and reveals 1 Card.\nThe chance to draw a Brown Pants Card is increased each time Platinumpool draws a card in this way. While Platinumpool is defending, Brown Pants Cards cannot be drawn.\nOnce per fight, if Platinumpool is interrupted before completing his dance during his Special 2 Attack, he gains a Regeneration Buff, recovering 2354.85 Health over 8 second(s).",
            "note": "This is the most important Special Attack for Platinumpool. He can use it to gain more Cards by completing his dance. Be careful though, each time you gain another card, you run the risk of pulling a Brown Pants Card."
        },
        "3": {
            "name": "Calling Card",
            "description": "Inflict a Bleed Debuff, dealing 3425.4 Direct Damage over 32 seconds. This Bleed scales with Special Attack Damage.\nDiscard all active Cards and draw 3 more.",
            "note": "Essentially the Special 3 allows Platinumpool to “shuffle” his cards back into his deck and get all new cards. Sometimes, the best way to play Platinumpool is to shuffle your cards until you get a deadly combination. Now it’s time to go through each Card and what they do!"
        }
    },
    "signature": {
        "name": "Legendary Boost",
        "description": "Unlock a very low chance to draw the Legendary Boost Card.\nIncrease the potency of all Common Card effects by 60%.",
        "note": "Okay I was dishonest, there’s one more card, the Legendary Boost! It works very similarly to other Boost Cards."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-platinumpool/"
    }
}