{
    "description": "Dr. Walter Langkowski was a professor of both physics and biophysics at McGill University. Trying to achieve a “Hulk-like” transformation similar to colleague Bruce Banner, Langkowski subjected himself to self-experimentation with gamma radiation. Unknowingly opening a doorway between our world and the “Realm of Great Beasts”. This allowed a mystical beast named “Tanaraq” to possess his body, granting him the ability to transform into a super-strong, orange-haired beast that resembled the legendary Sasquatch.",
    "gameplay": {
        "description": "From the Bush:  \n- A thick fur coat provides 90% Coldsnap resistance along with immunity to Frostbite effects and Armor Break Debuffs.\n- If Regeneration Rate is inverted, all Regen effects are removed.\n- Gain +25% Combat Power Rate if the Opponent has a Buff or is suffering from a Stagger Debuff, this is increased to +50% if the Opponent has 4 or more of these effects.\n\n\nSpirit of Rage – Max Stacks 15:\n- Light Attacks have a 30% chance to build 1 Rage. Chance increased to 100% on the 3rd Light Attack in each combo.\n- Build 1 Rage every 4.5 seconds that Sasquatch didn’t land a hit.\n- Each stack of Rage reduces incoming damage from all sources except Special 3 by 5% per stack.\n- Rage is not affected by Ability Accuracy reduction but is prevented while suffering from an Enervate or Exhaustion Debuff.\n\n\nWrath of Tanaraq:\n- If Sasquatch has 5 or more Rage, each stack gained above this threshold has a flat 10% chance to remove all stacks and trigger Wrath of Tanaraq. This lasts for 1.70 seconds per stack removed.\n- During Wrath of Tanaraq, Sasquatch is Stun Immune.\n- Gain 1130.77 Block Penetration and +50% Combat Power Rate.\n- Special Attack 1 and 2 cost 50% less power and Special Attack 3 costs 25% less Power.\n- While the Opponent has 3 full Bars of Power, Special and Heavy Attacks will Power Drain 5% of their max Power."
    },
    "attack": {
        "description": "Medium Attacks:\n- 30% chance to inflict a Rupture Debuff, dealing 1060.5 Physical Damage over 17 seconds. +70% chance during Wrath of Tanaraq.",
        "heavy": "- Inflict Stagger for 14 seconds causing the next Buff the Opponent gains to be Nullified. Max 2."
    },
    "specials": {
        "1": {
            "description": "- Each hit refreshes the Opponent’s Rupture Debuffs. This can trigger into the Opponent’s block.\n- If the final hit is blocked it has a 20% chance to inflict a Stun Debuff for 3 seconds. Chance increased to 100% during Wrath of Tanaraq.",
            "note": "Special 1 is best used when Wrath of Tanaraq is not active, allowing you to refresh any active Ruptures for a big Special 2 once you reactivate Wrath of Tanaraq."
        },
        "2": {
            "description": "- The first 2 hits remove the Opponent’s Rupture Debuffs, gaining 2969.4 Attack Rating for each Rupture removed. This is increased by 50% if activated during Wrath of Tanaraq.\n- The final hit inflicts up to 3 Rupture Debuffs, each dealing 3181.5 Physical Damage over 17 seconds.",
            "note": "Special 2 is best used with a large stack of Ruptures on the Opponent and while Wrath of Tanaraq is active. The more Ruptures you can stack the bigger this damage will be! Most of the damage here comes from the hits in this attack rather than the Ruptures themselves so removing some stacks of Rupture to gain more Attack Rating is a worthwhile exchange to make"
        },
        "3": {
            "description": "- Passively Regenerate 10% of missing health over 5 seconds. This is increased by a flat +1% per Rage Stack.\n- Gain up to +5 Stacks of Rage and enter Wrath of Tanaraq. These stacks don’t count toward the Regeneration.",
            "note": "Special 3 is best used to top up on missing health or jump start a long lasting Wrath of Tanaraq! Also because this attack triggers Wrath, it will cost 25% less power, leaving you very close to a Special 1 right after!"
        }
    },
    "signature": {
        "description": "Old Beast of the North\n- When below 40% of max health getting struck by a Contact Attack has a 70% chance to activate Sasquatch’s healing factor, Passively Regenerating 5% of missing health over 20 seconds. Max stacks 3.\n- During Wrath of Tanaraq Sasquatch becomes Passively Unstoppable during Special and Heavy Attacks and the Opponent’s Defensive Combat Power Rate is reduced by 70% when struck by these Attacks.",
        "note": "Sasquatch’s Signature Ability regeneration can be great when going Unstoppable and eating a hit or two during Wrath. Additionally, although his Specials and Heavy will never push the Opponent to their Special 3, his sig will slow down the rate at which they gain power from these hits, meaning less Special baiting and more smashing!"
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-sasquatch/"
    }
}